Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: Note for Linux users: on Linux, the C functions C<getpid()> and C<getppid()> return different values from different threads.
es_es: Nota para usuarios Linux: en Linux, las funciones C C<getpid()> y C<getppid()> devuelven valores diferentes para hilos (threads) diferentes.

source: In order to be portable, this behavior is not reflected by the perl-level function C<getppid()>, that returns a consistent value across threads.
es_es: Para ser portable, este comportamiento no está reflejado en la función C<getppid()>, que devuelve un valor consistente en todos los hilos.

source: If you want to call the underlying C<getppid()>, you may use the CPAN module C<Linux::Pid>.
es_es: Si quiere llamar a la subyacente C<getppid()>, puede usar el módulo de CPAN C<Linux::Pid>.

source: =item getpriority WHICH,WHO X<getpriority> X<priority> X<nice>
es_es: =item getpriority QUÉ,QUIEN X<getpriority> X<prioridad> X<nice>

source: Returns the current priority for a process, a process group, or a user.
es_es: Devuelve la prioridad actual de un proceso, un grupo de procesos o un usuario.

source: (See L<getpriority(2)>.) Will raise a fatal exception if used on a machine that doesn't implement getpriority(2).
es_es: (Ver L<getpriority(2)>). Elevará una excepción fatal si se usa en una máquina que no implemente getpriority(2).

source: =item getpwnam NAME X<getpwnam> X<getgrnam> X<gethostbyname> X<getnetbyname> X<getprotobyname> X<getpwuid> X<getgrgid> X<getservbyname> X<gethostbyaddr> X<getnetbyaddr> X<getprotobynumber> X<getservbyport> X<getpwent> X<getgrent> X<gethostent> X<getnetent> X<getprotoent> X<getservent> X<setpwent> X<setgrent> X<sethostent> X<setnetent> X<setprotoent> X<setservent> X<endpwent> X<endgrent> X<endhostent> X<endnetent> X<endprotoent> X<endservent>
es_es: =item getpwnam NOMBRE X<getpwnam> X<getgrnam> X<gethostbyname> X<getnetbyname> X<getprotobyname> X<getpwuid> X<getgrgid> X<getservbyname> X<gethostbyaddr> X<getnetbyaddr> X<getprotobynumber> X<getservbyport> X<getpwent> X<getgrent> X<gethostent> X<getnetent> X<getprotoent> X<getservent> X<setpwent> X<setgrent> X<sethostent> X<setnetent> X<setprotoent> X<setservent> X<endpwent> X<endgrent> X<endhostent> X<endnetent> X<endprotoent> X<endservent>

source: =item getgrnam NAME
es_es: =item getgrnam NOMBRE

source: =item gethostbyname NAME
es_es: =item gethostbyname NOMBRE

source: =item getnetbyname NAME
es_es: =item getnetbyname NOMBRE

source: =item getprotobyname NAME
es_es: =item getprotobyname NOMBRE

source: =item getservbyname NAME,PROTO
es_es: =item getservbyname NOMBRE,PROTO

source: =item gethostbyaddr ADDR,ADDRTYPE
es_es: =item gethostbyaddr DIRECCIÓN,TIPODIR

source: =item getnetbyaddr ADDR,ADDRTYPE
es_es: =item getnetbyaddr DIRECCIÓN,TIPODIR

source: =item getprotobynumber NUMBER
es_es: =item getprotobynumber NÚMERO

source: =item getservbyport PORT,PROTO
es_es: =item getservbyport PUERTO,PROTO

source: =item sethostent STAYOPEN
es_es: =item sethostent SIGUEABIERTO

source: =item setnetent STAYOPEN
es_es: =item setnetent SIGUEABIERTO

source: =item setprotoent STAYOPEN
es_es: =item setprotoent SIGUEABIERTO

source: =item setservent STAYOPEN
es_es: =item setservent SIGUEABIERTO

source: These routines perform the same functions as their counterparts in the system library.
es_es: Estas rutinas realizan las mismas funciones que sus homólogas en la biblioteca del sistema.

source: In list context, the return values from the various get routines are as follows:
es_es: En contexto lista, los valores devueltos por varias de ellas son como sigue:

source: ($name,$passwd,$uid,$gid,
es_es: ($nombre,$contrasena,$uid,$gid,

source: $quota,$comment,$gcos,$dir,$shell,$expire) = getpw*
es_es: $cuota,$comentario,$gcos,$dir,$shell,$expira) = getpw*

source: ($name,$passwd,$gid,$members) = getgr*
es_es: ($nombre,$contrasena,$gid,$miembros) = getgr*

source: ($name,$aliases,$addrtype,$length,@addrs) = gethost*
es_es: ($nombre,$alias,$tipodir,$longitud,@direcciones) = gethost*

source: ($name,$aliases,$addrtype,$net) = getnet*
es_es: ($nombre,$alias,$tipodir,$red) = getnet*

source: ($name,$aliases,$proto) = getproto*
es_es: ($nombre,$alias,$proto) = getproto*

source: ($name,$aliases,$port,$proto) = getserv*
es_es: ($nombre,$alias,$puerto,$proto) = getserv*

source: (If the entry doesn't exist you get a null list.)
es_es: (Si la entrada no existe, obtendrá una lista nula).

source: The exact meaning of the $gcos field varies but it usually contains the real name of the user (as opposed to the login name) and other information pertaining to the user.
es_es: El significado exacto del campo $gcos varía pero usualmente contiene el nombre real del usuario (como opuesto al nombre de login) y otra información perteneciente al usuario.

source: Beware, however, that in many system users are able to change this information and therefore it cannot be trusted and therefore the $gcos is tainted (see L<perlsec>).
es_es: Tenga cuidado, sin embargo, que en muchos sistemas los usuarios son capaces de cambiar esta información y por eso no puede confiarse y por eso el $gcos es considerado contaminado (ver L<perlsec>).

source: The $passwd and $shell, user's encrypted password and login shell, are also tainted, because of the same reason.
es_es: La $contrasena y el $shell, la contraseña encriptada del usuario y el shell del login, están también contaminados, por la misma razón.

source: In scalar context, you get the name, unless the function was a lookup by name, in which case you get the other thing, whatever it is.
es_es: En contexto escalar, obtiene el nombre, a menos que la función fuera localizar por nombre, en cuyo caso obtendrá la otra cosa, cualquiera que sea.

source: (If the entry doesn't exist you get the undefined value.) For example:
es_es: (Si la entrada no existe obtendrá el valor indefinido). Por ejemplo:

source: $uid = getpwnam($name);
es_es: $uid = getpwnam($nombre);

source: $name = getpwuid($num);
es_es: $nombre = getpwuid($numero);

source: $name = getpwent();
es_es: $nombre = getpwent();

source: $gid = getgrnam($name);
es_es: $gid = getgrnam($nombre);

source: $name = getgrgid($num);
es_es: $nombre = getgrgid($numero);

source: $name = getgrent();
es_es: $nombre = getgrent();

source: In I<getpw*()> the fields $quota, $comment, and $expire are special cases in the sense that in many systems they are unsupported.
es_es: En I<getpw*()> los campos $cuota, $comentario y $expira son casos especiales en el sentido que en muchos sistemas no están soportados.

source: If the $quota is unsupported, it is an empty scalar.
es_es: Si la $cuota no está soportada, es un escalar vacío.

source: If it is supported, it usually encodes the disk quota.
es_es: Si está soportada, usualmente codifica la cuota de disco.

source: If the $comment field is unsupported, it is an empty scalar.
es_es: Si el campo $comentario no está soportado, es un escalar vacío.

source: If it is supported it usually encodes some administrative comment about the user.
es_es: Si está soportado usualmente codifica algún comentario administrativo sobre el usuario.

source: In some systems the $quota field may be $change or $age, fields that have to do with password aging.
es_es: En algunos sistemas el campo $cuota puede ser $cambio o $edad, campos que tienen que ver con la caducidad de la contraseña.

source: In some systems the $comment field may be $class.
es_es: En algunos sistemas el campo $comentario puede ser $clase.

source: The $expire field, if present, encodes the expiration period of the account or the password.
es_es: El campo $expira, si está presente, codifica el periodo de expiración de la cuenta o de la contraseña.

source: For the availability and the exact meaning of these fields in your system, please consult your getpwnam(3) documentation and your F<pwd.h> file.
es_es: Para la disponibilidad y el significado exacto de estos campos en su sistema, por favor consulte la documentación de su getpwnam(3) y su fichero F<pwd.h>.

source: You can also find out from within Perl what your $quota and $comment fields mean and whether you have the $expire field by using the C<Config> module and the values C<d_pwquota>, C<d_pwage>, C<d_pwchange>, C<d_pwcomment>, and C<d_pwexpire>.
es_es: Puede también encontrar dentro de Perl que es lo que significan sus campos $cuota, $comentario y $expira usando el módulo C<Config> y los valores C<d_pwquota>, C<d_pwage>, C<d_pwchange>, C<d_pwcomment> y C<d_pwexpire>.

source: Shadow password files are only supported if your vendor has implemented them in the intuitive fashion that calling the regular C library routines gets the shadow versions if you're running under privilege or if there exists the shadow(3) functions as found in System V (this includes Solaris and Linux.) Those systems that implement a proprietary shadow password facility are unlikely to be supported.
es_es: Ficheros de contraseñas Shadow sólo están soportados si el proveedor los ha implementado con la intuitiva moda de que llamando a las rutinas regulares de la biblioteca C se obtiene las versiones shadow si está corriendo con bajos privilegios o si existe la función shadow(3) tal como se encuentra en System V (esto incluye Solaris y Linux). Los sistemas que implementen un sistema de contraseñas shadow propietario es impropable que sean soportados.

source: The $members value returned by I<getgr*()> is a space separated list of the login names of the members of the group.
es_es: El valor de $miembros devuelto por I<getgr*()> es una lista separada por espacios de los nombres de login de los miembros del grupo.

source: For the I<gethost*()> functions, if the C<h_errno> variable is supported in C, it will be returned to you via C<$?> if the function call fails.
es_es: Para las funciones I<gethost*()>, si la variable C<h_errno> está soportada en C, será devuelta vía C<$?> si la llamada a la función falla.

source: The C<@addrs> value returned by a successful call is a list of the raw addresses returned by the corresponding system library call.
es_es: El valor devuelto C<@direcciones> por una exitosa llamada es una lista de las direcciones en crudo devueltas por la correspondiente llamada a la biblioteca del sistema.

source: In the Internet domain, each address is four bytes long and you can unpack it by saying something like:
es_es: En el dominio de Internet, cada dirección son cuatro bytes de longitud y puede empaquetarlos diciendo algo como:

source: ($a,$b,$c,$d) = unpack('C4',$addr[0]);
es_es: ($a,$b,$c,$d) = unpack('C4',$direccion[0]);

source: The Socket library makes this slightly easier:
es_es: La biblioteca Socket hace esto ligeramente más fácilmente:

source: $iaddr = inet_aton("127.1"); # or whatever address
es_es: $idireccion = inet_aton("127.1"); # o la dirección que sea

source: $name = gethostbyaddr($iaddr, AF_INET);
es_es: $nombre = gethostbyaddr($idireccion, AF_INET);

source: # or going the other way
es_es: # o de otra manera

source: $straddr = inet_ntoa($iaddr);
es_es: $direccion = inet_ntoa($idireccion);

source: If you get tired of remembering which element of the return list contains which return value, by-name interfaces are provided in standard modules: C<File::stat>, C<Net::hostent>, C<Net::netent>, C<Net::protoent>, C<Net::servent>, C<Time::gmtime>, C<Time::localtime>, and C<User::grent>.
es_es: Si está cansado de recordar qué elemento de la lista devuelta contiene qué valor, existen interfaces por nombre, en módulos estándar: C<File::stat>, C<Net::hostent>, C<Net::netent>, C<Net::protoent>, C<Net::servent>, C<Time::gmtime>, C<Time::localtime> y C<User::grent>.

source: These override the normal built-ins, supplying versions that return objects with the appropriate names for each field.
es_es: Estas sobreescriben a las integradas, con versiones que devuelven objetos con los nombres apropiados para cada campo.

source: $is_his = (stat($filename)->uid == pwent($whoever)->uid);
es_es: $es_suyo = (stat($fichero)->uid == pwent($alguien)->uid);

source: Even though it looks like they're the same method calls (uid), they aren't, because a C<File::stat> object is different from a C<User::pwent> object.
es_es: Incluso aunque parezcan los mismos métodos (uid), no lo son, porque un objeto C<File::stat> es diferente de un objeto C<User::pwent>.

source: Returns the packed sockaddr address of this end of the SOCKET connection, in case you don't know the address because you have several different IPs that the connection might have come in on.
es_es: Devuelve la dirección de socket empaquetada de este final de la conexión SOCKET, en el caso de que no conozca la dirección porque tenga diferentes IP por las que la conexión se pudo haber realizado.

source: $mysockaddr = getsockname(SOCK);
es_es: $midirsocket = getsockname(SOCK);

source: ($port, $myaddr) = sockaddr_in($mysockaddr);
es_es: ($puerto, $midir) = sockaddr_in($midirsocket);

# printf "Connect to %s [%s] ",
source: printf "Connect to %s [%s]\n",
es_es: printf "Conectado a %s [%s]\n",

source: scalar gethostbyaddr($myaddr, AF_INET),
es_es: scalar gethostbyaddr($midir, AF_INET),

source: inet_ntoa($myaddr);
es_es: inet_ntoa($midir);

source: =item getsockopt SOCKET,LEVEL,OPTNAME X<getsockopt>
es_es: =item getsockopt SOCKET,NIVEL,OPCIÓN X<getsockopt>

source: Queries the option named OPTNAME associated with SOCKET at a given LEVEL.
es_es: Consulta la opción con nombre OPCIÓN asociada con el SOCKET en un determinado NIVEL.

source: Options may exist at multiple protocol levels depending on the socket type, but at least the uppermost socket level SOL_SOCKET (defined in the C<Socket> module) will exist.
es_es: Opciones pueden existir en múltiples niveles de protocolo dependiendo del tipo de socket, pero al menos existirá el más alto nivel de socket SOL_SOCKET (definido en el módulo C<Socket>).

source: To query options at another level the protocol number of the appropriate protocol controlling the option should be supplied.
es_es: Para consultar opciones en otro nivel se debe indicar el apropiado número de protocolo que controle a esa opción.

source: For example, to indicate that an option is to be interpreted by the TCP protocol, LEVEL should be set to the protocol number of TCP, which you can get using getprotobyname.
es_es: Por ejemplo, para indicar que una opción a de ser interpretada por el protocolo TCP, NIVEL debe ser puesto al número de protocolo del TCP, que puede obtener usando getprotobyname.

source: The call returns a packed string representing the requested socket option, or C<undef> if there is an error (the error reason will be in $!).
es_es: La llamada devuelve un string empaquetado representando la opción socket solicitada, o C<undef> si hay un error (la razón del error estará en $!).

source: What exactly is in the packed string depends in the LEVEL and OPTNAME, consult your system documentation for details.
es_es: Lo que exactamente esté en el string empaquetado depende de NIVEL y OPCIÓN, consulte la documentación de su sistema para los detalles.

source: A very common case however is that the option is an integer, in which case the result will be a packed integer which you can decode using unpack with the C<i> (or C<I>) format.
es_es: Un caso muy común es que la opción sea un entero, en cuyo caso el resultado será un entero empaquetado que podrá decodificar usando unpack con el formato C<i> (o C<I>).

source: An example testing if Nagle's algorithm is turned on on a socket:
es_es: Un ejemplo para comprobar su el algoritmo de Nagle está activado en el socket:

source: defined(my $tcp = getprotobyname("tcp")) or die "Could not determine the protocol number for tcp";
es_es: defined(my $tcp = getprotobyname("tcp")) or die "No puedo determinar el número del protocolo tcp";

source: # my $tcp = IPPROTO_TCP; # Alternative
es_es: # my $tcp = IPPROTO_TCP; # Alternativo

source: my $packed = getsockopt($socket, $tcp, TCP_NODELAY) or die "Could not query TCP_NODELAY socket option: $!";
es_es: my $empaquetado = getsockopt($socket, $tcp, TCP_NODELAY) or die "No puedo consultar la opción socket TCP_NODELAY: $!";

source: my $nodelay = unpack("I", $packed);
es_es: my $nodelay = unpack("I", $empaquetado);

source: print "Nagle's algorithm is turned ", $nodelay ?
es_es: print "El algoritmo de Nagle está activado: ", $nodelay ?

source: =item glob EXPR X<glob> X<wildcard> X<filename, expansion> X<expand>
es_es: =item glob EXPR X<glob> X<metacaracter> X<fichero, expansión> X<expandir>

source: In list context, returns a (possibly empty) list of filename expansions on the value of EXPR such as the standard Unix shell F</bin/csh> would do.
es_es: En contecto lista, devuelve una (posiblemente vacía) lista de la expansión de nombres de fichero del valor de EXPR como si el shell estandar Unix F</bin/csh> lo hiciera.

source: In scalar context, glob iterates through such filename expansions, returning undef when the list is exhausted.
es_es: En contexto escalar, glob itera a través de la expansión de nombres de fichero, devolviendo undef cuando se agote la lista.

source: This is the internal function implementing the C<< <*.c> >> operator, but you can use it directly.
es_es: Esto es la función interna que implementa el operador C<< <*.c> >>, pero puede usarla directamente.

source: If EXPR is omitted, C<$_> is used.
es_es: Si la EXPR se omite, se usa C<$_>.

source: The C<< <*.c> >> operator is discussed in more detail in L<perlop/"I/O Operators">.
es_es: El operador C<< <*.c> >> se discute con más detalle en L<perlop/"Operadores I/O">.

source: Beginning with v5.6.0, this operator is implemented using the standard C<File::Glob> extension.
es_es: Comenzando con v5.6.0, este operador está implementado usando la extensión estándar C<File::Glob>.

source: See L<File::Glob> for details.
es_es: Ver L<File::Glob> para detalles.

source: Converts a time as returned by the time function to an 9-element list with the time localized for the standard Greenwich time zone.
es_es: Convierte un tiempo devuelto por la función time en una lista de 9 elementos según la región de la zona horaria estándar Greenwich.

source: Typically used as follows:
es_es: Típicamente se usa como sigue:

source: ($sec,$min,$hour,$mday,$mon,$year,$wday,$yday,$isdst) = gmtime(time);
es_es: ($seg,$min,$hora,$mdia,$mes,$anno,$sdia,$ydia,$esdst) = gmtime(time);

source: All list elements are numeric, and come straight out of the C `struct tm'.
es_es: Todos los elementos de la lista son numéricos y derivan de la 'struct tm' del C.

source: $sec, $min, and $hour are the seconds, minutes, and hours of the specified time.
es_es: $seg, $min y $hora son los segundos, minutos y horas del tiempo especificado.

source: $mday is the day of the month, and $mon is the month itself, in the range C<0..11> with 0 indicating January and 11 indicating December.
es_es: $mdia es el día del mes, y $mes es el propio mes, en el rango C<0..11> con 0 indicando enero y 11 diciembre.

source: $year is the number of years since 1900.
es_es: $anno es el número de años desde 1900.

source: That is, $year is C<123> in year 2023.
es_es: Es decir, $anno es C<123> en el año 2023.

source: $wday is the day of the week, with 0 indicating Sunday and 3 indicating Wednesday.
es_es: $sdia es el día de la semaan, con 0 indicando domingo y 3 indicando miércoles.

source: $yday is the day of the year, in the range C<0..364> (or C<0..365> in leap years).
es_es: $ydia es el día del año, en el rango C<0..364> (o C<0..365> en años bisiestos).

source: $isdst is always C<0>.
es_es: $esdst siempre es C<0>.

source: Note that the $year element is I<not> simply the last two digits of the year.
es_es: Note que el elemento $anno I<no> es simplemente los dos últimos dígitos del año.

source: If you assume it is then you create non-Y2K-compliant programs--and you wouldn't want to do that, would you?
es_es: Si asume eso entonces estará creado programas no compatibles con el año 2000, y eso no es lo que quiere hacer, ¿verdad?

source: The proper way to get a complete 4-digit year is simply:
es_es: La forma apropiada para obtener un año con los 4 dígitos es simplemente:

source: $year += 1900;
es_es: $anno += 1900;

source: And to get the last two digits of the year (e.g., '01' in 2001) do:
es_es: Y para obtener los dos últimos dígitos del año (ej., '01' en 2001) hacer:

source: $year = sprintf("%02d", $year % 100);
es_es: $anno = sprintf("%02d", $anno % 100);

source: If EXPR is omitted, C<gmtime()> uses the current time (C<gmtime(time)>).
es_es: Si se omite EXPR, C<gmtime()> usa el tiempo actual (C<gmtime(time)>).

source: In scalar context, C<gmtime()> returns the ctime(3) value:
es_es: En contexto escalar, C<gmtime()> devuelve el valor de ctime(3):

source: $now_string = gmtime; # e.g., "Thu Oct 13 04:54:34 1994"
es_es: $ahora_string = gmtime; # ej., "Thu Oct 13 04:54:34 1994"

source: If you need local time instead of GMT use the L</localtime> builtin.
es_es: Si necesita el tiempo local en lugar del GMT, use L</localtime>.

source: See also the C<timegm> function provided by the C<Time::Local> module, and the strftime(3) and mktime(3) functions available via the L<POSIX> module.
es_es: Ver también la función C<timegm> proporcionado por el módulo C<Time::Local>, y las funciones strftime(3) y mktime(3) disponibles con el módulo L<POSIX>.

source: This scalar value is B<not> locale dependent (see L<perllocale>), but is instead a Perl builtin.
es_es: Este valor escalar B<no> es localmente dependiente (ver L<perllocale>), sino que es una función integrada de Perl.

source: To get somewhat similar but locale dependent date strings, see the example in L</localtime>.
es_es: Para obtener algo similar pero con fechas localmente dependientes, ver el ejemplo en L</localtime>.

source: See L<perlport/gmtime> for portability concerns.
es_es: Ver L<perlport/gmtime> para problemas sobre portabilidad.

source: =item goto LABEL X<goto> X<jump> X<jmp>
es_es: =item goto ETIQUETA X<goto> X<salto> X<jmp>

source: =item goto &NAME
es_es: =item goto &NOMBRE

source: The C<goto-LABEL> form finds the statement labeled with LABEL and resumes execution there.
es_es: La forma C<goto>-ETIQUETA busca la sentencia etiquetada con ETIQUETA y continua la ejecución desde allí.

source: It may not be used to go into any construct that requires initialization, such as a subroutine or a C<foreach> loop.
es_es: No puede ser usado en ninguna construcción que requiera inicialización, como una subrutina o un bucle C<foreach>.

source: It also can't be used to go into a construct that is optimized away, or to get out of a block or subroutine given to C<sort>.
es_es: Tampoco puede ser usada en una construcción que pueda ser optimizada, o ir fuera de un bloque o subrutina dada a C<sort>.

source: It can be used to go almost anywhere else within the dynamic scope, including out of subroutines, but it's usually better to use some other construct such as C<last> or C<die>.
es_es: Puede ser utilizada para ir a casi cualquier sitio que esté dentro del ámbito dinámico, incluyendo fuera de las subrutinas, pero es usualmente mucho mejor usar otras construcciones como C<last> o C<die>.

source: The author of Perl has never felt the need to use this form of C<goto> (in Perl, that is--C is another matter).
es_es: El autor de Perl nunca ha sentido la necesidad de usar esta forma de C<goto> (en Perl, desde luego. C es otra historia).

source: (The difference being that C does not offer named loops combined with loop control.
es_es: (La diferencia con C es que no ofrece bucles con nombre combinados con control de bucles.

source: Perl does, and this replaces most structured uses of C<goto> in other languages.)
es_es: Perl sí, y esto reemplaza a la mayor parte de los usos estructurados de C<goto> en otros lenguajes).
